[{"quote": "I always had passion for rap music and I was always trying to create a situation to where I could do this fulltime.  "}, {"quote": "Thought is powerful in all phases. Even in my career even in my life things end up exactly how I visualized them.  "}, {"quote": "I never wanted to alienate my brand for business. I always wanted to keep it authentic and keep as pure as I could.  "}, {"quote": "On a mission your worst enemy is idle time.  "}, {"quote": "Im about seeing longterm seeing a vision understanding nothing really worthwhile happens overnight and just sticking to your script long enough to make something real happen.  "}, {"quote": "If you dont know your fullthrottle history the whole story of how you came to where you are its kind of hard to put things together.  "}, {"quote": "To me respect comes first.  "}, {"quote": "My thing is that I dont give no person that much power over my path that Im walking. Not one person can make or break what Im doing except me or God.  "}, {"quote": "Without a game plan and without a strong sense of faith in what youre doing its gonna be real hard to accomplish anything.  "}, {"quote": "And its possible to monetize your art without compromising the integrity of it for commerce.  "}, {"quote": "Im focusing on the music but I still got a cold library of books that Ive either read or I plan on getting to.  "}, {"quote": "Most important thing is to get rid of doubt. If you got doubt in what youre doing its not gonna work.  "}, {"quote": "I knew I wanted to work for myself when I was about eleven.  "}, {"quote": "Before rap my last name was my lifestyle and when I visualize success it looked like right now.  "}, {"quote": "If youve got a plan its not just like a pipe dream. You have a stepbystep list of things to do to get to your goal.  "}, {"quote": "I feel that luck is a product of hard work.  "}, {"quote": "Were not the cause were the effect.  "}, {"quote": "Youve got to have faith in what youre doing and not take no for an answer.  "}, {"quote": "Your parents are supposed to tell you to make decisions that are gonna help you and thatll have a positive effect on your life and your wellbeing.  "}, {"quote": "I hit the league straight out the streets with no talent scout.  "}, {"quote": "Success to me is just being able to do what you love to do and support yourself all through.  "}, {"quote": "If you sharing your success and not your struggle yous a fool.  "}, {"quote": "If you dont have a plan its very hard to really have faith in what youre doing cause soon as something pop up its gonna look like the endall.  "}, {"quote": "Im more focused on giving solutions and inspiration more than anything.  "}, {"quote": "Im at peace with what Im doing I feel good with what I wake up doing and about my lifestyle.  "}, {"quote": "Most the time when it rains it start pouring but how we grind it make the weather change for us.  "}, {"quote": "Hope opportunity dont knock when opportunists in your group.  "}, {"quote": "Dedication hard work plus patience.  "}, {"quote": "We got turned down we failed had setbacks had to start over a lot of times. But we kept going at it. In anybodys case thats always the distinguishing factor.  "}, {"quote": "Instead of trying to build a brick wall lay a brick every day. Eventually youll look up and youll have a brick wall.  "}, {"quote": "Luck is just being prepared at all times so when the door opens youre ready.  "}, {"quote": "I just believe in ownership. I believe in investing in yourself. Your foundation should be strong.  "}, {"quote": "Success or greatness come with a rollercoaster ride anybody can apply the marathon concept to what they do.  "}, {"quote": "Sometimes you have to take two steps back to take ten forward.  "}, {"quote": "Instead of trying to build a brick wall lay a brick everyday. Eventually youll look up and youll have a brick wall.   "}, {"quote": "Most important thing is to get rid of doubt. If you got doubt in what youre doing its not gonna work.   "}, {"quote": "Youve got to have faith in what youre doing and not take no for an answer.    "}, {"quote": " Success to me is just being able to do what you love to do and support yourself all through.    "}, {"quote": "We got turned down we failed had set backs had to start over a lot of times. But we kept going at it. In anybodys case thats always the distinguishing factor.    "}, {"quote": "Without a game plan and without a strong sense of faith in what youre doing its gonna be real hard to accomplish anything.    "}, {"quote": "I just believe in ownership I believe in investing in yourselfYour foundation should be strong.   "}, {"quote": "Sometimes you have to take two steps back to take ten forward.   "}, {"quote": "I never wanted to alienate my brand for business  I always wanted to keep it authentic and keep as pure as I could.    "}, {"quote": "My thing is that I dont give no person that much power over my path that Im walking. Not one person can make or break what Im doing except me or God.    "}, {"quote": "so check out these Lil Peep quotes about love life and music."}, {"quote": "Luck is just bein prepared at all times so when the door opens youre ready.    "}, {"quote": "Seize the opportunity believe and take control of it. Then get on your marathon and grind it til its over with.    "}, {"quote": "Your parents are supposed to tell you to make decisions that are gonna help you and thatll have a positive effect on your life and your wellbeing.     "}, {"quote": "Im more focused on giving solutions and inspiration more than anything.    "}, {"quote": "Im focusing on the music but I still got a cold library of books that Ive either read or I plan on getting to.    "}, {"quote": "To me respect comes first.    "}, {"quote": "Hopin what Im doing truly make my mama proud Cause for a very long time I was the reason for her frowns.   "}, {"quote": "Be truthful with yourself and other people and try your best to make decisions outside of your ego.    "}, {"quote": "Id rather invest in real estate  invest in some assets as opposed to trick all my money in diamonds and cars  it look good but at the end of the day youre losing value. It aint appreciating its depreciating. Im trying to get a real asset. Take care of my people.    "}, {"quote": "Material things aint nothing you feel me At the end of the day its who you is.    "}, {"quote": "Success or greatness come with a rollercoaster ride anybody can apply the marathon concept to what they do.    "}, {"quote": "Were not the cause were the effect.   "}, {"quote": "Im at peace with what Im doing I feel good with what I wake up doing and about my lifestyle.   "}, {"quote": "If you dont know your fullthrottle history the whole story of how you came to where you are its kind of hard to put things together.   "}, {"quote": "On a mission your worst enemy is idle time.   "}, {"quote": "I always had passion for rap music and I was always trying to create a situation to where I could do this fulltime.    "}, {"quote": "And its possible to monetize your art without compromising the integrity of it for commerce.   "}, {"quote": "Before rap my last name was my lifestyle and when I visualize success it looked like right now.   "}, {"quote": "Most of the time I look inside And find the answers waitin.   "}, {"quote": "I hit the league straight out the streets wit no talent scout.   "}, {"quote": "Aint gone be no east cost west coast war. Aint gone be no black men killing black men.    "}, {"quote": "We playing the long game. We dont want the money to stop when we go. When we cant work no more. We want it to outlive us we want it to be generational    "}, {"quote": "I call it dropping the rope. Youve got to drop a rope. Everybody got to climb up but you gotta drop the rope.    "}, {"quote": "If youve got a plan its not just like a pipe dream. You have a stepbystep list of things to do to get to your goal.    "}, {"quote": "I believe that economics is based on scarcity of markets and its possible to monetize your art without compromising the integrity of it for commerce.    "}, {"quote": "Circle got smaller everybody cant go    "}, {"quote": "Thought is powerful in all phases. Even in my career even in my life things end up exactly how I visualized them.    "}, {"quote": "I think you can give a pure artistic product if you understand how to build your own industry.    "}, {"quote": "I knew I wanted to work for myself when I was about eleven   "}, {"quote": "Im about seeing longterm seeing a vision understanding nothing really worthwhile happens overnight and just sticking to your script long enough to make something real happen.   "}, {"quote": "None of my peers avoided prison. None of em.   "}, {"quote": "I realized the power of hiphop. I realized how influential this music and this culture are.   "}, {"quote": "Black people in America people from the struggle immigrants its no generational wealth that we are attached to so we are tasked to create  in one generation  closing the gap. Thats why we so Doomsday about getting to the check cause its life or death for real.   "}, {"quote": "If I wasnt involved in this hiphop sht Id probably be breakin the law to eat and feed my family and maintain the lifestyle that Im used to.    "}, {"quote": "Every artist wants something different out the game.   "}, {"quote": "Life is what you make it I hope you make a movement.    "}, {"quote": "I grew up in an environment where being polite was taken as a weakness. So I just fought everybody.   "}, {"quote": "When I became a man and I started to understand the difference between the truth and what your parents are supposed to tell you theres a difference know what I mean    "}, {"quote": "I intend to inspire people with my story motivate young people that grew up like myself or even not like myself. Just you know go through the human experience.   "}, {"quote": "Gangbanging is a survival instinct regardless of how anybody tries to paint it.    "}, {"quote": "Even as you make progress you need the discipline to keep from backtracking and sabotaging the success as its happening.   "}, {"quote": "And it can be as simple as it seems If you never doubt yourself and learn from everything you see   "}, {"quote": "Im the type person my safe place to be emotional is the booth.   "}, {"quote": "I was never ignorant as far as being experienced in classrooms and learning about different subjects and actually soaking it up.    "}, {"quote": "Youre not going to scare me into being somebody I dont want to be.   "}, {"quote": "An artist always know everything he does you know what Im saying all the record he starts and dont end up in the public and just sit on the harddrive.    "}, {"quote": "I identify myself as a hustler since I was a young kid.   "}, {"quote": "As gang members as young dudes in the streets especially in L.A. were the effect of a situation. We didnt wake up and create our own mindstate and our environment we adapted our survival instincts.    "}, {"quote": "I built a company at the same time I built a career.   "}, {"quote": "Obviously from childhood to my teenage years I really came into my own. I left the house early I was on the streets when I was like . Ive been holdin my own since that age.    "}, {"quote": "I say its worth it I wont say its fair Find your purpose or you wastin air.    "}, {"quote": "Turning up my hustles how I give myself a raise    "}, {"quote": "Started out the trunk ended up at the dealership    "}, {"quote": "If youre a hustler you should find somewhere to capitalize off that and turn it into some money.    "}, {"quote": "I dont know about hell I dont know about heaven All I know is bout right now and this lifestyle is interesting    "}, {"quote": "Every step is like chess The wrong move gets you killed So we act on how we think And never speak on how we feel.    "}, {"quote": "And what good is dreaming If you cant make your sht come true    "}, {"quote": "What good is a team When everyone depends on you    "}, {"quote": "Cause if you sharing your success And not your struggle yous a fool.    "}, {"quote": "Im tryin to live my life so when its over I got no regrets    "}, {"quote": "Try to have more faith and less fear Try to express it to your peers Im talking bout dreams Better to do it and let it be seen cause then its so clear    "}, {"quote": "I hate to lose so I play too rough    "}, {"quote": "Finish what we started reach them heights you know    "}, {"quote": "Play the game like Ive never won once    "}, {"quote": "Gotta cross my Ts and dot my Is or I cant sleep well    "}, {"quote": "Dont worry bout what people gon say girl do what you want to    "}, {"quote": "Dont waste your time it dont make you rich    "}, {"quote": "When you let go of your pride youll find a lesson in your pain    "}, {"quote": "This technology has empowered everybody. And its giving people you know its as big as you wanna make it and you know its as far as you take it    "}, {"quote": "Its strictly business in this game still they faking friendly. Dont let em take advantage of you and it make em envy    "}, {"quote": "If you look at the people in your circle and dont get inspired then you dont have a circle. You have a cage.    "}, {"quote": "Be more fearless. All my radical moonshots have defined me. That dont be my downfall my downfall will be not going crazy not having a higher expectation. Anytime I done set my sight on something that seemed way outlandish it always come back exactly how I seen it. So I think I would tell myself to just put way bigger goals on the wall. Just have a bigger vision have a higher expectation.    "}, {"quote": "You will never be criticized by someone who is doing more than you. You will only be criticized by someone who is doing less than you. Remember that.    "}, {"quote": "The best thing you can do for a person is to inspire them. Thats the best currency you can offer inspiration.    "}, {"quote": "A speaker of truth has no friends.    "}, {"quote": "Define who you are and what you are and be clear on that. Meditate on that and then live and die by that. You cant break the rules the fundamental rules. Be a man of your word do what you say youre gonna do respect people the way you would like to be respected.    "}, {"quote": "Most important thing to get rid of is doubt. If you got doubt in what youre doing its not going to work.   "}, {"quote": "The company you keep has a large influence on the situations you bring to yourself.    "}, {"quote": "I taught all my people how to fish. Some caught more than others. Some said they rather be fed. Some passed me up in the process. But at the end of it all I know I aint hide the game from my people and Im real for that.   "}, {"quote": "I took my wildest dreams then mapped them out. I go for mine like its overtime me and my nggas had to struggle so we overshine.    "}, {"quote": "Instead of trying to build a brick wall lay a brick everyday. Eventually youll look up and youll have a brick wall.   "}, {"quote": "Most important thing is to get rid of doubt. If you got doubt in what youre doing its not gonna work.   "}, {"quote": "Youve got to have faith in what youre doing and not take no for an answer.    "}, {"quote": " Success to me is just being able to do what you love to do and support yourself all through.    "}, {"quote": "We got turned down we failed had set backs had to start over a lot of times. But we kept going at it. In anybodys case thats always the distinguishing factor.    "}, {"quote": "Without a game plan and without a strong sense of faith in what youre doing its gonna be real hard to accomplish anything.    "}, {"quote": "I just believe in ownership I believe in investing in yourselfYour foundation should be strong.   "}, {"quote": "Sometimes you have to take two steps back to take ten forward.   "}, {"quote": "I never wanted to alienate my brand for business  I always wanted to keep it authentic and keep as pure as I could.    "}, {"quote": "My thing is that I dont give no person that much power over my path that Im walking. Not one person can make or break what Im doing except me or God.    "}, {"quote": "so check out these Lil Peep quotes about love life and music."}, {"quote": "Luck is just bein prepared at all times so when the door opens youre ready.    "}, {"quote": "Seize the opportunity believe and take control of it. Then get on your marathon and grind it til its over with.    "}, {"quote": "Your parents are supposed to tell you to make decisions that are gonna help you and thatll have a positive effect on your life and your wellbeing.     "}, {"quote": "Im more focused on giving solutions and inspiration more than anything.    "}, {"quote": "Im focusing on the music but I still got a cold library of books that Ive either read or I plan on getting to.    "}, {"quote": "To me respect comes first.    "}, {"quote": "Hopin what Im doing truly make my mama proud Cause for a very long time I was the reason for her frowns.   "}, {"quote": "Be truthful with yourself and other people and try your best to make decisions outside of your ego.    "}, {"quote": "Id rather invest in real estate  invest in some assets as opposed to trick all my money in diamonds and cars  it look good but at the end of the day youre losing value. It aint appreciating its depreciating. Im trying to get a real asset. Take care of my people.    "}, {"quote": "Material things aint nothing you feel me At the end of the day its who you is.    "}, {"quote": "Success or greatness come with a rollercoaster ride anybody can apply the marathon concept to what they do.    "}, {"quote": "Were not the cause were the effect.   "}, {"quote": "Im at peace with what Im doing I feel good with what I wake up doing and about my lifestyle.   "}, {"quote": "If you dont know your fullthrottle history the whole story of how you came to where you are its kind of hard to put things together.   "}, {"quote": "On a mission your worst enemy is idle time.   "}, {"quote": "I always had passion for rap music and I was always trying to create a situation to where I could do this fulltime.    "}, {"quote": "And its possible to monetize your art without compromising the integrity of it for commerce.   "}, {"quote": "Before rap my last name was my lifestyle and when I visualize success it looked like right now.   "}, {"quote": "Most of the time I look inside And find the answers waitin.   "}, {"quote": "I hit the league straight out the streets wit no talent scout.   "}, {"quote": "Aint gone be no east cost west coast war. Aint gone be no black men killing black men.    "}, {"quote": "We playing the long game. We dont want the money to stop when we go. When we cant work no more. We want it to outlive us we want it to be generational    "}, {"quote": "I call it dropping the rope. Youve got to drop a rope. Everybody got to climb up but you gotta drop the rope.    "}, {"quote": "If youve got a plan its not just like a pipe dream. You have a stepbystep list of things to do to get to your goal.    "}, {"quote": "I believe that economics is based on scarcity of markets and its possible to monetize your art without compromising the integrity of it for commerce.    "}, {"quote": "Circle got smaller everybody cant go    "}, {"quote": "Thought is powerful in all phases. Even in my career even in my life things end up exactly how I visualized them.    "}, {"quote": "I think you can give a pure artistic product if you understand how to build your own industry.    "}, {"quote": "I knew I wanted to work for myself when I was about eleven   "}, {"quote": "Im about seeing longterm seeing a vision understanding nothing really worthwhile happens overnight and just sticking to your script long enough to make something real happen.   "}, {"quote": "None of my peers avoided prison. None of em.   "}, {"quote": "I realized the power of hiphop. I realized how influential this music and this culture are.   "}, {"quote": "Black people in America people from the struggle immigrants its no generational wealth that we are attached to so we are tasked to create  in one generation  closing the gap. Thats why we so Doomsday about getting to the check cause its life or death for real.   "}, {"quote": "If I wasnt involved in this hiphop sht Id probably be breakin the law to eat and feed my family and maintain the lifestyle that Im used to.    "}, {"quote": "Every artist wants something different out the game.   "}, {"quote": "Life is what you make it I hope you make a movement.    "}, {"quote": "I grew up in an environment where being polite was taken as a weakness. So I just fought everybody.   "}, {"quote": "When I became a man and I started to understand the difference between the truth and what your parents are supposed to tell you theres a difference know what I mean    "}, {"quote": "I intend to inspire people with my story motivate young people that grew up like myself or even not like myself. Just you know go through the human experience.   "}, {"quote": "Gangbanging is a survival instinct regardless of how anybody tries to paint it.    "}, {"quote": "Even as you make progress you need the discipline to keep from backtracking and sabotaging the success as its happening.   "}, {"quote": "And it can be as simple as it seems If you never doubt yourself and learn from everything you see   "}, {"quote": "Im the type person my safe place to be emotional is the booth.   "}, {"quote": "I was never ignorant as far as being experienced in classrooms and learning about different subjects and actually soaking it up.    "}, {"quote": "Youre not going to scare me into being somebody I dont want to be.   "}, {"quote": "An artist always know everything he does you know what Im saying all the record he starts and dont end up in the public and just sit on the harddrive.    "}, {"quote": "I identify myself as a hustler since I was a young kid.   "}, {"quote": "As gang members as young dudes in the streets especially in L.A. were the effect of a situation. We didnt wake up and create our own mindstate and our environment we adapted our survival instincts.    "}, {"quote": "I built a company at the same time I built a career.   "}, {"quote": "Obviously from childhood to my teenage years I really came into my own. I left the house early I was on the streets when I was like . Ive been holdin my own since that age.    "}, {"quote": "I say its worth it I wont say its fair Find your purpose or you wastin air.    "}, {"quote": "Turning up my hustles how I give myself a raise    "}, {"quote": "Started out the trunk ended up at the dealership    "}, {"quote": "If youre a hustler you should find somewhere to capitalize off that and turn it into some money.    "}, {"quote": "I dont know about hell I dont know about heaven All I know is bout right now and this lifestyle is interesting    "}, {"quote": "Every step is like chess The wrong move gets you killed So we act on how we think And never speak on how we feel.    "}, {"quote": "And what good is dreaming If you cant make your sht come true    "}, {"quote": "What good is a team When everyone depends on you    "}, {"quote": "Cause if you sharing your success And not your struggle yous a fool.    "}, {"quote": "Im tryin to live my life so when its over I got no regrets    "}, {"quote": "Try to have more faith and less fear Try to express it to your peers Im talking bout dreams Better to do it and let it be seen cause then its so clear    "}, {"quote": "I hate to lose so I play too rough    "}, {"quote": "Finish what we started reach them heights you know    "}, {"quote": "Play the game like Ive never won once    "}, {"quote": "Gotta cross my Ts and dot my Is or I cant sleep well    "}, {"quote": "Dont worry bout what people gon say girl do what you want to    "}, {"quote": "Dont waste your time it dont make you rich    "}, {"quote": "When you let go of your pride youll find a lesson in your pain    "}, {"quote": "This technology has empowered everybody. And its giving people you know its as big as you wanna make it and you know its as far as you take it    "}, {"quote": "Its strictly business in this game still they faking friendly. Dont let em take advantage of you and it make em envy    "}, {"quote": "If you look at the people in your circle and dont get inspired then you dont have a circle. You have a cage.    "}, {"quote": "Be more fearless. All my radical moonshots have defined me. That dont be my downfall my downfall will be not going crazy not having a higher expectation. Anytime I done set my sight on something that seemed way outlandish it always come back exactly how I seen it. So I think I would tell myself to just put way bigger goals on the wall. Just have a bigger vision have a higher expectation.    "}, {"quote": "You will never be criticized by someone who is doing more than you. You will only be criticized by someone who is doing less than you. Remember that.    "}, {"quote": "The best thing you can do for a person is to inspire them. Thats the best currency you can offer inspiration.    "}, {"quote": "A speaker of truth has no friends.    "}, {"quote": "Define who you are and what you are and be clear on that. Meditate on that and then live and die by that. You cant break the rules the fundamental rules. Be a man of your word do what you say youre gonna do respect people the way you would like to be respected.    "}, {"quote": "Most important thing to get rid of is doubt. If you got doubt in what youre doing its not going to work.   "}, {"quote": "The company you keep has a large influence on the situations you bring to yourself.    "}, {"quote": "I taught all my people how to fish. Some caught more than others. Some said they rather be fed. Some passed me up in the process. But at the end of it all I know I aint hide the game from my people and Im real for that.   "}, {"quote": "I took my wildest dreams then mapped them out. I go for mine like its overtime me and my nggas had to struggle so we overshine.    "}, {"quote": "Instead of trying to build a brick wall lay a brick everyday. Eventually youll look up and youll have a brick wall.   "}, {"quote": "Most important thing is to get rid of doubt. If you got doubt in what youre doing its not gonna work.   "}, {"quote": "Youve got to have faith in what youre doing and not take no for an answer.    "}, {"quote": " Success to me is just being able to do what you love to do and support yourself all through.    "}, {"quote": "We got turned down we failed had set backs had to start over a lot of times. But we kept going at it. In anybodys case thats always the distinguishing factor.    "}, {"quote": "Without a game plan and without a strong sense of faith in what youre doing its gonna be real hard to accomplish anything.    "}, {"quote": "I just believe in ownership I believe in investing in yourselfYour foundation should be strong.   "}, {"quote": "Sometimes you have to take two steps back to take ten forward.   "}, {"quote": "I never wanted to alienate my brand for business  I always wanted to keep it authentic and keep as pure as I could.    "}, {"quote": "My thing is that I dont give no person that much power over my path that Im walking. Not one person can make or break what Im doing except me or God.    "}, {"quote": "so check out these Lil Peep quotes about love life and music."}, {"quote": "Luck is just bein prepared at all times so when the door opens youre ready.    "}, {"quote": "Seize the opportunity believe and take control of it. Then get on your marathon and grind it til its over with.    "}, {"quote": "Your parents are supposed to tell you to make decisions that are gonna help you and thatll have a positive effect on your life and your wellbeing.     "}, {"quote": "Im more focused on giving solutions and inspiration more than anything.    "}, {"quote": "Im focusing on the music but I still got a cold library of books that Ive either read or I plan on getting to.    "}, {"quote": "To me respect comes first.    "}, {"quote": "Hopin what Im doing truly make my mama proud Cause for a very long time I was the reason for her frowns.   "}, {"quote": "Be truthful with yourself and other people and try your best to make decisions outside of your ego.    "}, {"quote": "Id rather invest in real estate  invest in some assets as opposed to trick all my money in diamonds and cars  it look good but at the end of the day youre losing value. It aint appreciating its depreciating. Im trying to get a real asset. Take care of my people.    "}, {"quote": "Material things aint nothing you feel me At the end of the day its who you is.    "}, {"quote": "Success or greatness come with a rollercoaster ride anybody can apply the marathon concept to what they do.    "}, {"quote": "Were not the cause were the effect.   "}, {"quote": "Im at peace with what Im doing I feel good with what I wake up doing and about my lifestyle.   "}, {"quote": "If you dont know your fullthrottle history the whole story of how you came to where you are its kind of hard to put things together.   "}, {"quote": "On a mission your worst enemy is idle time.   "}, {"quote": "I always had passion for rap music and I was always trying to create a situation to where I could do this fulltime.    "}, {"quote": "And its possible to monetize your art without compromising the integrity of it for commerce.   "}, {"quote": "Before rap my last name was my lifestyle and when I visualize success it looked like right now.   "}, {"quote": "Most of the time I look inside And find the answers waitin.   "}, {"quote": "I hit the league straight out the streets wit no talent scout.   "}, {"quote": "Aint gone be no east cost west coast war. Aint gone be no black men killing black men.    "}, {"quote": "We playing the long game. We dont want the money to stop when we go. When we cant work no more. We want it to outlive us we want it to be generational    "}, {"quote": "I call it dropping the rope. Youve got to drop a rope. Everybody got to climb up but you gotta drop the rope.    "}, {"quote": "If youve got a plan its not just like a pipe dream. You have a stepbystep list of things to do to get to your goal.    "}, {"quote": "I believe that economics is based on scarcity of markets and its possible to monetize your art without compromising the integrity of it for commerce.    "}, {"quote": "Circle got smaller everybody cant go    "}, {"quote": "Thought is powerful in all phases. Even in my career even in my life things end up exactly how I visualized them.    "}, {"quote": "I think you can give a pure artistic product if you understand how to build your own industry.    "}, {"quote": "I knew I wanted to work for myself when I was about eleven   "}, {"quote": "Im about seeing longterm seeing a vision understanding nothing really worthwhile happens overnight and just sticking to your script long enough to make something real happen.   "}, {"quote": "None of my peers avoided prison. None of em.   "}, {"quote": "I realized the power of hiphop. I realized how influential this music and this culture are.   "}, {"quote": "Black people in America people from the struggle immigrants its no generational wealth that we are attached to so we are tasked to create  in one generation  closing the gap. Thats why we so Doomsday about getting to the check cause its life or death for real.   "}, {"quote": "If I wasnt involved in this hiphop sht Id probably be breakin the law to eat and feed my family and maintain the lifestyle that Im used to.    "}, {"quote": "Every artist wants something different out the game.   "}, {"quote": "Life is what you make it I hope you make a movement.    "}, {"quote": "I grew up in an environment where being polite was taken as a weakness. So I just fought everybody.   "}, {"quote": "When I became a man and I started to understand the difference between the truth and what your parents are supposed to tell you theres a difference know what I mean    "}, {"quote": "I intend to inspire people with my story motivate young people that grew up like myself or even not like myself. Just you know go through the human experience.   "}, {"quote": "Gangbanging is a survival instinct regardless of how anybody tries to paint it.    "}, {"quote": "Even as you make progress you need the discipline to keep from backtracking and sabotaging the success as its happening.   "}, {"quote": "And it can be as simple as it seems If you never doubt yourself and learn from everything you see   "}, {"quote": "Im the type person my safe place to be emotional is the booth.   "}, {"quote": "I was never ignorant as far as being experienced in classrooms and learning about different subjects and actually soaking it up.    "}, {"quote": "Youre not going to scare me into being somebody I dont want to be.   "}, {"quote": "An artist always know everything he does you know what Im saying all the record he starts and dont end up in the public and just sit on the harddrive.    "}, {"quote": "I identify myself as a hustler since I was a young kid.   "}, {"quote": "As gang members as young dudes in the streets especially in L.A. were the effect of a situation. We didnt wake up and create our own mindstate and our environment we adapted our survival instincts.    "}, {"quote": "I built a company at the same time I built a career.   "}, {"quote": "Obviously from childhood to my teenage years I really came into my own. I left the house early I was on the streets when I was like . Ive been holdin my own since that age.    "}, {"quote": "I say its worth it I wont say its fair Find your purpose or you wastin air.    "}, {"quote": "Turning up my hustles how I give myself a raise    "}, {"quote": "Started out the trunk ended up at the dealership    "}, {"quote": "If youre a hustler you should find somewhere to capitalize off that and turn it into some money.    "}, {"quote": "I dont know about hell I dont know about heaven All I know is bout right now and this lifestyle is interesting    "}, {"quote": "Every step is like chess The wrong move gets you killed So we act on how we think And never speak on how we feel.    "}, {"quote": "And what good is dreaming If you cant make your sht come true    "}, {"quote": "What good is a team When everyone depends on you    "}, {"quote": "Cause if you sharing your success And not your struggle yous a fool.    "}, {"quote": "Im tryin to live my life so when its over I got no regrets    "}, {"quote": "Try to have more faith and less fear Try to express it to your peers Im talking bout dreams Better to do it and let it be seen cause then its so clear    "}, {"quote": "I hate to lose so I play too rough    "}, {"quote": "Finish what we started reach them heights you know    "}, {"quote": "Play the game like Ive never won once    "}, {"quote": "Gotta cross my Ts and dot my Is or I cant sleep well    "}, {"quote": "Dont worry bout what people gon say girl do what you want to    "}, {"quote": "Dont waste your time it dont make you rich    "}, {"quote": "When you let go of your pride youll find a lesson in your pain    "}, {"quote": "This technology has empowered everybody. And its giving people you know its as big as you wanna make it and you know its as far as you take it    "}, {"quote": "Its strictly business in this game still they faking friendly. Dont let em take advantage of you and it make em envy    "}, {"quote": "If you look at the people in your circle and dont get inspired then you dont have a circle. You have a cage.    "}, {"quote": "Be more fearless. All my radical moonshots have defined me. That dont be my downfall my downfall will be not going crazy not having a higher expectation. Anytime I done set my sight on something that seemed way outlandish it always come back exactly how I seen it. So I think I would tell myself to just put way bigger goals on the wall. Just have a bigger vision have a higher expectation.    "}, {"quote": "You will never be criticized by someone who is doing more than you. You will only be criticized by someone who is doing less than you. Remember that.    "}, {"quote": "The best thing you can do for a person is to inspire them. Thats the best currency you can offer inspiration.    "}, {"quote": "A speaker of truth has no friends.    "}, {"quote": "Define who you are and what you are and be clear on that. Meditate on that and then live and die by that. You cant break the rules the fundamental rules. Be a man of your word do what you say youre gonna do respect people the way you would like to be respected.    "}, {"quote": "Most important thing to get rid of is doubt. If you got doubt in what youre doing its not going to work.   "}, {"quote": "The company you keep has a large influence on the situations you bring to yourself.    "}, {"quote": "I taught all my people how to fish. Some caught more than others. Some said they rather be fed. Some passed me up in the process. But at the end of it all I know I aint hide the game from my people and Im real for that.   "}, {"quote": "I took my wildest dreams then mapped them out. I go for mine like its overtime me and my nggas had to struggle so we overshine.    "}]