[
    {
        "quote": "I always had passion for rap music and I was always trying to create a situation to where I could do this fulltime.  "
    },
    {
        "quote": "Thought is powerful in all phases. Even in my career even in my life things end up exactly how I visualized them.  "
    },
    {
        "quote": "I never wanted to alienate my brand for business. I always wanted to keep it authentic and keep as pure as I could.  "
    },
    {
        "quote": "On a mission your worst enemy is idle time.  "
    },
    {
        "quote": "Im about seeing longterm seeing a vision understanding nothing really worthwhile happens overnight and just sticking to your script long enough to make something real happen.  "
    },
    {
        "quote": "If you dont know your fullthrottle history the whole story of how you came to where you are its kind of hard to put things together.  "
    },
    {
        "quote": "To me respect comes first.  "
    },
    {
        "quote": "My thing is that I dont give no person that much power over my path that Im walking. Not one person can make or break what Im doing except me or God.  "
    },
    {
        "quote": "Without a game plan and without a strong sense of faith in what youre doing its gonna be real hard to accomplish anything.  "
    },
    {
        "quote": "And its possible to monetize your art without compromising the integrity of it for commerce.  "
    },
    {
        "quote": "Im focusing on the music but I still got a cold library of books that Ive either read or I plan on getting to.  "
    },
    {
        "quote": "Most important thing is to get rid of doubt. If you got doubt in what youre doing its not gonna work.  "
    },
    {
        "quote": "I knew I wanted to work for myself when I was about eleven.  "
    },
    {
        "quote": "Before rap my last name was my lifestyle and when I visualize success it looked like right now.  "
    },
    {
        "quote": "If youve got a plan its not just like a pipe dream. You have a stepbystep list of things to do to get to your goal.  "
    },
    {
        "quote": "I feel that luck is a product of hard work.  "
    },
    {
        "quote": "Were not the cause were the effect.  "
    },
    {
        "quote": "Youve got to have faith in what youre doing and not take no for an answer.  "
    },
    {
        "quote": "Your parents are supposed to tell you to make decisions that are gonna help you and thatll have a positive effect on your life and your wellbeing.  "
    },
    {
        "quote": "I hit the league straight out the streets with no talent scout.  "
    },
    {
        "quote": "Success to me is just being able to do what you love to do and support yourself all through.  "
    },
    {
        "quote": "If you sharing your success and not your struggle yous a fool.  "
    },
    {
        "quote": "If you dont have a plan its very hard to really have faith in what youre doing cause soon as something pop up its gonna look like the endall.  "
    },
    {
        "quote": "Im more focused on giving solutions and inspiration more than anything.  "
    },
    {
        "quote": "Im at peace with what Im doing I feel good with what I wake up doing and about my lifestyle.  "
    },
    {
        "quote": "Most the time when it rains it start pouring but how we grind it make the weather change for us.  "
    },
    {
        "quote": "Hope opportunity dont knock when opportunists in your group.  "
    },
    {
        "quote": "Dedication hard work plus patience.  "
    },
    {
        "quote": "We got turned down we failed had setbacks had to start over a lot of times. But we kept going at it. In anybodys case thats always the distinguishing factor.  "
    },
    {
        "quote": "Instead of trying to build a brick wall lay a brick every day. Eventually youll look up and youll have a brick wall.  "
    },
    {
        "quote": "Luck is just being prepared at all times so when the door opens youre ready.  "
    },
    {
        "quote": "I just believe in ownership. I believe in investing in yourself. Your foundation should be strong.  "
    },
    {
        "quote": "Success or greatness come with a rollercoaster ride anybody can apply the marathon concept to what they do.  "
    },
    {
        "quote": "Sometimes you have to take two steps back to take ten forward.  "
    }
]